'use strict';

console.log('arr' + ' - object');
console.log(4 + +'5'); // унарный +

// инкремент и декримент

let incr = 10,
    decr = 10;

incr++; // оператор инкримента, увеличение на единицу
decr--; // оператор декриментаб уменьшение на единицу

++incr; // префексный
decr--; // постфиксный

console.log(incr);
console.log(decr);

/*  одно = это присваивание!

два == это сравнивание (по значению)
три === это строгое сравнение (сравнивае как по типу данных так и по значению)
 */

// && - оператор И
// || - оператор ИЛИ

// оператор Отрицания !
// != не равно!
// !== Строгое не равно!
